Autodesk.Revit.DB.Electrical.VoltageTypeSet
A set that contains voltage types.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.Insert(Autodesk.Revit.DB.Electrical.VoltageType)
System.Int32
Insert the specified voltage type into the set.
item: The voltage type to be inserted into the set.
Returns: Returns whether the voltage type was inserted into the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.ReverseIterator
Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.ForwardIterator
Autodesk.Revit.DB.Electrical.VoltageTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.Erase(Autodesk.Revit.DB.Electrical.VoltageType)
System.Int32
Removes a specified voltage type from the set.
item: The voltage type to be erased.
Returns: The number of voltage types that were erased from the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.Contains(Autodesk.Revit.DB.Electrical.VoltageType)
System.Boolean
Tests for the existence of a voltage type within the set.
item: The voltage type to be searched for.
Returns: The Contains method returns True if the voltage type is within the set, otherwise False.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.Clear
void
Removes every voltage type from the set, rendering it empty.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.Size
System.Int32
get
Returns the number of voltage types that are in the set.

Autodesk.Revit.DB.Electrical.VoltageTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.